{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"classification": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/rescaling/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/rescaling/Cast_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_2/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_4/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_6/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_12/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/classification/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/classification/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_12/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_1/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_12/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_2/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_2/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_3/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_3/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_12/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_4/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_4/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_4/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_12/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_5/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_5/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_5/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_13/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_6/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_6/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_6/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_6/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_13/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_7/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_7/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_7/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_7/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_8/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_8/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_8/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_13/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_8/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_9/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_9/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_9/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_13/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_9/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_10/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_10/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_10/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_10/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_11/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_11/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_11/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_11/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/rescaling/mul", "op": "Mul", "input": ["input_2", "StatefulPartitionedCall/model/rescaling/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/rescaling/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/rescaling/mul", "StatefulPartitionedCall/model/rescaling/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv1_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/rescaling/add", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv1/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv1_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_1/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_1/depthwise_bn_offset"], "attr": {"padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_1_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_1/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_1/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_2/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_1_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_2/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_2/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_2/Pad", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_2/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_2/depthwise_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_2_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_2/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_2/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_3/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_2_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_3/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_3/depthwise_bn_offset"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_3_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_3/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_3/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_4/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_3_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_4/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_4/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_4/Pad", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_4/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_4/depthwise_bn_offset"], "attr": {"padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_4_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_4/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_4/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_5/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_4_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_5/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_5/depthwise_bn_offset"], "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_5_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_5/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_5/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_6/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_5_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_6/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_6/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_6/Pad", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_6/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_6/depthwise_bn_offset"], "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_6_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_6/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_6/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_7/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_6_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_7/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_7/depthwise_bn_offset"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_7_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_7/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_7/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_8/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_7_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_8/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_8/depthwise_bn_offset"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_8_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_8/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_8/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_9/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_8_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_9/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_9/depthwise_bn_offset"], "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_9_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_9/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_9/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_9/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_10/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_9_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_10/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_10/depthwise_bn_offset"], "attr": {"num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_10_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_10/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_10/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_10/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_11/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_10_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_11/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_11/depthwise_bn_offset"], "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_11_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_11/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_11/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_11/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_12/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_11_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_12/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_12/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_12/Pad", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_12/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_12/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_12_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_12/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_12/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_12/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_13/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_12_relu/Relu6", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_13/depthwise_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_13/depthwise_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_13_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_13/depthwise", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_13/Conv2D_weights", "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_13/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/model/global_average_pooling2d/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_13_relu/Relu6", "StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/global_average_pooling2d/Mean", "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/dense_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense_1/Relu", "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model/classification/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense_2/Relu", "StatefulPartitionedCall/model/classification/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/classification/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/classification/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/classification/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/classification/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/rescaling/Cast/x", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/rescaling/Cast_1/x", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_2/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_4/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_6/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pad_12/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "shape": [1024, 1024], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "shape": [1024, 1024], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "shape": [1024, 512], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/classification/MatMul/ReadVariableOp", "shape": [512, 5], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/classification/BiasAdd/ReadVariableOp", "shape": [5], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv1/Conv2D_weights", "shape": [3, 3, 3, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv1/Conv2D_bn_offset", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_12/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_1/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_1/depthwise_bn_offset", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_1/Conv2D_weights", "shape": [1, 1, 32, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_1/Conv2D_bn_offset", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_12/depthwise_bn_offset", "shape": [512], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_2/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_2/depthwise_bn_offset", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_2/Conv2D_weights", "shape": [1, 1, 64, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_2/Conv2D_bn_offset", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_3/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_3/depthwise_bn_offset", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_3/Conv2D_weights", "shape": [1, 1, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_12/Conv2D_weights", "shape": [1, 1, 512, 1024], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_3/Conv2D_bn_offset", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_4/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_4/depthwise_bn_offset", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_4/Conv2D_weights", "shape": [1, 1, 128, 256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_12/Conv2D_bn_offset", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_4/Conv2D_bn_offset", "shape": [256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_5/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_5/depthwise_bn_offset", "shape": [256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_5/Conv2D_weights", "shape": [1, 1, 256, 256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_5/Conv2D_bn_offset", "shape": [256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_13/depthwise_weights", "shape": [3, 3, 1024, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_6/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_dw_6/depthwise_bn_offset", "shape": [256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/mobilenet_1.00_224/conv_pw_6/Conv2D_weights", "shape": [1, 1, 256, 512], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": 